docs/gyss.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-15 Wed 11:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jethro Kuan" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org945e35c">1. Preparing for the Fourth Industrial Revolution</a>
<ul>
<li><a href="#orgc516662">1.1. John Hopcroft</a>
<ul>
<li><a href="#org2928a9f">1.1.1. On Change</a></li>
<li><a href="#orged13732">1.1.2. Is AI really artificial intelligence?</a></li>
<li><a href="#org864f868">1.1.3. How to choose the problems you work on?</a></li>
<li><a href="#org1f7a2b2">1.1.4. Does the degree matter?</a></li>
<li><a href="#org5479b48">1.1.5. What does it mean for a computer to be more intelligent than a human being?</a></li>
<li><a href="#org1a4c798">1.1.6. Privacy as a trade-off</a></li>
<li><a href="#org14d3e0a">1.1.7. Can computers formulate problems that humans want to work with?</a></li>
<li><a href="#orgf9b25eb">1.1.8. Concentration of power</a></li>
<li><a href="#org3603892">1.1.9. Working on a healthy way towards the 4th Industrial Revolution?</a></li>
<li><a href="#org0c1b10f">1.1.10. Computers and morality</a></li>
<li><a href="#org8a734b5">1.1.11. Anything that scares you about the 4th Industrial Revolution?</a></li>
<li><a href="#org7f0afca">1.1.12. What area of research would you want to work on?</a></li>
<li><a href="#org9adaeaf">1.1.13. Advice</a></li>
</ul>
</li>
<li><a href="#orge69e885">1.2. Stuart Parkins</a>
<ul>
<li><a href="#orgc610b79">1.2.1. Drivers for 4th Industrial Revolution that are non-computing related</a></li>
<li><a href="#orgf620a75">1.2.2. How to choose the problems you work on?</a></li>
<li><a href="#org5c39c29">1.2.3. Does the degree matter?</a></li>
<li><a href="#orgd44d064">1.2.4. Jethro - Why is this guy so controversial?</a></li>
<li><a href="#orgd3ec15e">1.2.5. Computers vs Human Beings</a></li>
<li><a href="#org0bae9e3">1.2.6. Can computers formulate problems that humans want to work with?</a></li>
<li><a href="#org119377c">1.2.7. Concentration of Power</a></li>
<li><a href="#org5279c61">1.2.8. Working on a healthy way towards the 4th Industrial Revolution?</a></li>
<li><a href="#org7f3f6cc">1.2.9. Computers and Morality</a></li>
<li><a href="#org9ae8f48">1.2.10. Anything that scares you about the 4th Industrial Revolution?</a></li>
<li><a href="#org63f69f0">1.2.11. What area of research would you want to work on?</a></li>
<li><a href="#org1208f91">1.2.12. Regulation of AI</a></li>
<li><a href="#orgc8ce7e8">1.2.13. Augmented Intelligence</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org945e35c" class="outline-2">
<h2 id="org945e35c"><span class="section-number-2">1</span> Preparing for the Fourth Industrial Revolution</h2>
<div class="outline-text-2" id="text-1">
<p>
The industrial revolutions:
</p>

<ol class="org-ol">
<li>Water/steam engine</li>
<li>Electricity</li>
<li>Electronics and Information Technology</li>
<li>9 areas of technologies: 3D printing, quantum computing&#x2026;???</li>
</ol>
</div>
<div id="outline-container-orgc516662" class="outline-3">
<h3 id="orgc516662"><span class="section-number-3">1.1</span> John Hopcroft</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Automate intellectual jobs, reducing the percentage of population
required to produce the goods and services we need, to 25%
<ul class="org-ul">
<li>3.5m truck drivers in the US
<ul class="org-ul">
<li>those jobs are going to disappear the same way elevator
operators disappear</li>
</ul></li>
<li>Employees in China checked it via face recognition</li>
</ul></li>
<li>We need to figure out how to engage the rest of the population in
meaningful activities</li>
<li>Universal guaranteed income?!</li>
</ul>
</div>
<div id="outline-container-org2928a9f" class="outline-4">
<h4 id="org2928a9f"><span class="section-number-4">1.1.1</span> On Change</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>Positive aspects and negative aspects to major change</li>
<li>Typically, the positive aspects dominate the negative aspects</li>
<li>2012 ImageNet competition. Up until 2012, the best error rate was
25%, but AlexNet brought this error rate down to 15%.</li>
</ul>
</div>
</div>
<div id="outline-container-orged13732" class="outline-4">
<h4 id="orged13732"><span class="section-number-4">1.1.2</span> Is AI really artificial intelligence?</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>No? The state-of-the-art is really pattern recognition in high
dimensional space.
<ul class="org-ul">
<li>Computer can recognise a bicycle, but can't recognise its
function.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org864f868" class="outline-4">
<h4 id="org864f868"><span class="section-number-4">1.1.3</span> How to choose the problems you work on?</h4>
<div class="outline-text-4" id="text-1-1-3">
<ul class="org-ul">
<li>"you get one life to live, and you ought to enjoy the entire lifetime"</li>
<li>"make a little investment for the future years"</li>
<li>could switch jobs because he was working in a non-experimental area</li>
</ul>
</div>
</div>
<div id="outline-container-org1f7a2b2" class="outline-4">
<h4 id="org1f7a2b2"><span class="section-number-4">1.1.4</span> Does the degree matter?</h4>
<div class="outline-text-4" id="text-1-1-4">
<ul class="org-ul">
<li>"degree is a union card"</li>
<li>optimal vs have-to-do
<ul class="org-ul">
<li>to get admission to top phd programs, some universities start
counting publications</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org5479b48" class="outline-4">
<h4 id="org5479b48"><span class="section-number-4">1.1.5</span> What does it mean for a computer to be more intelligent than a human being?</h4>
<div class="outline-text-4" id="text-1-1-5">
<ul class="org-ul">
<li>what is a good definition of intelligence?
<ul class="org-ul">
<li>his old definition: "the ability to solve problems"</li>
</ul></li>
<li>computers only have the ability to solve a certain class of
problems, given a large amount of computing power</li>
</ul>
</div>
</div>
<div id="outline-container-org1a4c798" class="outline-4">
<h4 id="org1a4c798"><span class="section-number-4">1.1.6</span> Privacy as a trade-off</h4>
<div class="outline-text-4" id="text-1-1-6">
<ul class="org-ul">
<li>Privacy is going to be a big issue in the 4th industrial revolution</li>
<li>We will change a little bit about what we allow companies and
corporations know about us</li>
<li>We can play back wherever the car have driven
<ul class="org-ul">
<li>Use this data to improve route guidance systems</li>
<li>but they can figure out things like where you work, where you shop</li>
<li>Solutions:
<ul class="org-ul">
<li>0-knowledge proof???</li>
<li><a href="https://en.wikipedia.org/wiki/Zero-knowledge_proof">https://en.wikipedia.org/wiki/Zero-knowledge_proof</a></li>
<li>e.g. prove that i can fill a sudoku puzzle without any
information of how to do it</li>
<li>importance, e.g.;
<ul class="org-ul">
<li>insurance companies get a rigorous mathematical proof about
how much money to pay the person</li>
<li>giving hospitals complete medical records, and not insurance
companies becomes a possibility</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org14d3e0a" class="outline-4">
<h4 id="org14d3e0a"><span class="section-number-4">1.1.7</span> Can computers formulate problems that humans want to work with?</h4>
<div class="outline-text-4" id="text-1-1-7">
<ul class="org-ul">
<li>Supervised learning vs unsupervised learning</li>
</ul>
</div>
</div>
<div id="outline-container-orgf9b25eb" class="outline-4">
<h4 id="orgf9b25eb"><span class="section-number-4">1.1.8</span> Concentration of power</h4>
<div class="outline-text-4" id="text-1-1-8">
<ul class="org-ul">
<li>Companies have only existed for 200 years, society can change and
nations evolved at soem point, it's not clear if even nations can continue.
<ul class="org-ul">
<li>Many companies are far more powerful than countries &#x2013; could they
begin to take the role of nations today?</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org3603892" class="outline-4">
<h4 id="org3603892"><span class="section-number-4">1.1.9</span> Working on a healthy way towards the 4th Industrial Revolution?</h4>
<div class="outline-text-4" id="text-1-1-9">
<ul class="org-ul">
<li>A century ago, people work 70 hours a week, and start working at 10</li>
<li>There's been a drastic reduction to a fraction of work power that's
actually being used</li>
<li>There are some countries looking at how to provide a guaranteed
financial income to people, and engage people in meaningful activity</li>
<li>Some people believe that only two countries will benefit from the AI
revolution: China and United States (nani??)
<ul class="org-ul">
<li>China is worried about the poor, how do we restructure society?</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org0c1b10f" class="outline-4">
<h4 id="org0c1b10f"><span class="section-number-4">1.1.10</span> Computers and morality</h4>
<div class="outline-text-4" id="text-1-1-10">
<ul class="org-ul">
<li>I work on simpler problems&#x2026;</li>
<li>Self driving cars in the US cannot be programmed to go beyond the
speed limit and violate the law
<ul class="org-ul">
<li>normal speed limit is 65 miles an hour, but most drive at 71-72
miles per hour</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org8a734b5" class="outline-4">
<h4 id="org8a734b5"><span class="section-number-4">1.1.11</span> Anything that scares you about the 4th Industrial Revolution?</h4>
<div class="outline-text-4" id="text-1-1-11">
<ul class="org-ul">
<li>optimistic, on average it's going to be a better world to live in</li>
</ul>
</div>
</div>
<div id="outline-container-org7f0afca" class="outline-4">
<h4 id="org7f0afca"><span class="section-number-4">1.1.12</span> What area of research would you want to work on?</h4>
<div class="outline-text-4" id="text-1-1-12">
<ul class="org-ul">
<li>Why does deep learning work?</li>
</ul>
</div>
</div>
<div id="outline-container-org9adaeaf" class="outline-4">
<h4 id="org9adaeaf"><span class="section-number-4">1.1.13</span> Advice</h4>
<div class="outline-text-4" id="text-1-1-13">
<ul class="org-ul">
<li>pick an assistant professor</li>
<li>career was built on the graduate students, APs are a better choice
typically.</li>
<li><a href="http://www.pgbovine.net/early-stage-PhD-advice.htm">http://www.pgbovine.net/early-stage-PhD-advice.htm</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge69e885" class="outline-3">
<h3 id="orge69e885"><span class="section-number-3">1.2</span> Stuart Parkins</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Bella likes his voice (mellow and deep, resonant, calming) 🎤</li>
<li>Our ability to compute has improved a thousandfold each decade</li>
<li>Humans are very poor at looking at the future and predicting what happens</li>
</ul>
</div>
<div id="outline-container-orgc610b79" class="outline-4">
<h4 id="orgc610b79"><span class="section-number-4">1.2.1</span> Drivers for 4th Industrial Revolution that are non-computing related</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>draw conclusions using algorithms that were developed 10-20 years
ago, because of huge computing power</li>
<li>computers, built on silicon, don't think the way humans think
<ul class="org-ul">
<li>systems that can model the human brain</li>
</ul></li>
<li><b>silicon increased in performance has slowed down considerably</b>
<ul class="org-ul">
<li><i>is there an alternative to silicon in research right now?</i></li>
</ul></li>
<li><b>"lateral thinking"</b>
<ul class="org-ul">
<li>How do you pick the problems to work on?</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgf620a75" class="outline-4">
<h4 id="orgf620a75"><span class="section-number-4">1.2.2</span> How to choose the problems you work on?</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>choose an interesting challenge, that is exciting and interesting</li>
</ul>
</div>
</div>
<div id="outline-container-org5c39c29" class="outline-4">
<h4 id="org5c39c29"><span class="section-number-4">1.2.3</span> Does the degree matter?</h4>
<div class="outline-text-4" id="text-1-2-3">
<ul class="org-ul">
<li>no you don't need a degree.</li>
<li>it's crazy that scientific journals can keep knowledge proprietary
when the research is largely funded by the government</li>
</ul>
</div>
</div>
<div id="outline-container-orgd44d064" class="outline-4">
<h4 id="orgd44d064"><span class="section-number-4">1.2.4</span> Jethro - Why is this guy so controversial?</h4>
</div>
<div id="outline-container-orgd3ec15e" class="outline-4">
<h4 id="orgd3ec15e"><span class="section-number-4">1.2.5</span> Computers vs Human Beings</h4>
<div class="outline-text-4" id="text-1-2-5">
<ul class="org-ul">
<li>We're limited in the number of neurons and synapses we have
<ul class="org-ul">
<li>observable from biology</li>
</ul></li>
<li>Computers are already more intelligent than humans in that sense</li>
</ul>
</div>
</div>
<div id="outline-container-org0bae9e3" class="outline-4">
<h4 id="org0bae9e3"><span class="section-number-4">1.2.6</span> Can computers formulate problems that humans want to work with?</h4>
<div class="outline-text-4" id="text-1-2-6">
<ul class="org-ul">
<li>Material discovery, taking a certain mix of elements you can
calculate their properties</li>
<li>Compute the inverse: given certain properties, can you give me a
material that works?</li>
</ul>
</div>
</div>
<div id="outline-container-org119377c" class="outline-4">
<h4 id="org119377c"><span class="section-number-4">1.2.7</span> Concentration of Power</h4>
<div class="outline-text-4" id="text-1-2-7">
<ul class="org-ul">
<li>IBM was the largest compute power in the world
<ul class="org-ul">
<li>only lasted a few decades, getting overwhelmed by pace of change</li>
</ul></li>
<li>Can already see signs of Google's mortality</li>
</ul>
</div>
</div>
<div id="outline-container-org5279c61" class="outline-4">
<h4 id="org5279c61"><span class="section-number-4">1.2.8</span> Working on a healthy way towards the 4th Industrial Revolution?</h4>
<div class="outline-text-4" id="text-1-2-8">
<ul class="org-ul">
<li>In silicon valley, people do work 70 hours a week</li>
<li>Maybe it will be a world where people will want to work!
<ul class="org-ul">
<li>Automate the mundane jobs, leaving the jobs that require creativity</li>
</ul></li>
<li>How do you want to distribute wealth, in Europe, people are already
are working a lot less than in the US and they are choosing
different models of a wealth distribution, so it boils downw to a
question of society and what people choose.</li>
</ul>
</div>
</div>
<div id="outline-container-org7f3f6cc" class="outline-4">
<h4 id="org7f3f6cc"><span class="section-number-4">1.2.9</span> Computers and Morality</h4>
<div class="outline-text-4" id="text-1-2-9">
<ul class="org-ul">
<li>Humans are programmed to preserve ourselves</li>
<li>E.g. car is programmed to save your own life than other people's lives</li>
</ul>
</div>
</div>
<div id="outline-container-org9ae8f48" class="outline-4">
<h4 id="org9ae8f48"><span class="section-number-4">1.2.10</span> Anything that scares you about the 4th Industrial Revolution?</h4>
<div class="outline-text-4" id="text-1-2-10">
<ul class="org-ul">
<li>super optimistic</li>
<li>systems would know how to auto-correct itself.</li>
</ul>
</div>
</div>
<div id="outline-container-org63f69f0" class="outline-4">
<h4 id="org63f69f0"><span class="section-number-4">1.2.11</span> What area of research would you want to work on?</h4>
<div class="outline-text-4" id="text-1-2-11">
<ul class="org-ul">
<li>How do human's think?</li>
</ul>
</div>
</div>
<div id="outline-container-org1208f91" class="outline-4">
<h4 id="org1208f91"><span class="section-number-4">1.2.12</span> Regulation of AI</h4>
<div class="outline-text-4" id="text-1-2-12">
<ul class="org-ul">
<li>How to regulate AI when not sure how it'll evolve?</li>
</ul>
</div>
</div>
<div id="outline-container-orgc8ce7e8" class="outline-4">
<h4 id="orgc8ce7e8"><span class="section-number-4">1.2.13</span> Augmented Intelligence</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jethro Kuan</p>
<p class="date">Created: 2018-08-15 Wed 11:02</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
